program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<string, []> var_44_pad_type_0 = const()[name = tensor<string, []>("op_44_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_44_pad_0 = const()[name = tensor<string, []>("op_44_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_44_strides_0 = const()[name = tensor<string, []>("op_44_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_44_dilations_0 = const()[name = tensor<string, []>("op_44_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_44_groups_0 = const()[name = tensor<string, []>("op_44_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [768, 80, 3]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [768, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368768)))];
            tensor<fp16, [1, 80, 3000]> logmel_data_to_fp16 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_49")];
            tensor<fp16, [1, 768, 3000]> var_44_cast_fp16 = conv(bias = const_1_to_fp16, dilations = var_44_dilations_0, groups = var_44_groups_0, pad = var_44_pad_0, pad_type = var_44_pad_type_0, strides = var_44_strides_0, weight = const_0_to_fp16, x = logmel_data_to_fp16)[name = tensor<string, []>("op_44_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_44_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_62_pad_type_0 = const()[name = tensor<string, []>("op_62_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_62_pad_0 = const()[name = tensor<string, []>("op_62_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_62_strides_0 = const()[name = tensor<string, []>("op_62_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_62_dilations_0 = const()[name = tensor<string, []>("op_62_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_62_groups_0 = const()[name = tensor<string, []>("op_62_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 3]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [768, 768, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(370368)))];
            tensor<fp16, [768]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3909376)))];
            tensor<fp16, [1, 768, 1500]> var_62_cast_fp16 = conv(bias = const_3_to_fp16, dilations = var_62_dilations_0, groups = var_62_groups_0, pad = var_62_pad_0, pad_type = var_62_pad_type_0, strides = var_62_strides_0, weight = const_2_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_62_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_62_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1500, 768]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [1500, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3910976)))];
            tensor<fp16, [1, 1500, 768]> x_5_cast_fp16 = transpose(perm = var_68, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 1500, 768]> var_71_cast_fp16 = add(x = x_5_cast_fp16, y = positional_embedding_to_fp16)[name = tensor<string, []>("op_71_cast_fp16")];
            tensor<int32, [1]> var_99_axes_0 = const()[name = tensor<string, []>("op_99_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_0_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6215040)))];
            tensor<fp16, [768]> blocks_0_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6216640)))];
            tensor<fp16, []> var_89_to_fp16 = const()[name = tensor<string, []>("op_89_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_99_cast_fp16 = layer_norm(axes = var_99_axes_0, beta = blocks_0_attn_ln_bias_to_fp16, epsilon = var_89_to_fp16, gamma = blocks_0_attn_ln_weight_to_fp16, x = var_71_cast_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<fp16, [768, 768]> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6218240)))];
            tensor<fp16, [768]> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7397952)))];
            tensor<fp16, [1, 1500, 768]> linear_0_cast_fp16 = linear(bias = const_5_to_fp16, weight = const_4_to_fp16, x = var_99_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [768, 768]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7399552)))];
            tensor<fp16, [768]> linear_1_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_1_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8579264)))];
            tensor<fp16, [1, 1500, 768]> linear_1_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = const_6_to_fp16, x = var_99_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [768, 768]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8580864)))];
            tensor<fp16, [768]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9760576)))];
            tensor<fp16, [1, 1500, 768]> linear_2_cast_fp16 = linear(bias = const_8_to_fp16, weight = const_7_to_fp16, x = var_99_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_123 = const()[name = tensor<string, []>("op_123"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_124_cast_fp16 = reshape(shape = var_123, x = linear_0_cast_fp16)[name = tensor<string, []>("op_124_cast_fp16")];
            tensor<int32, [4]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_130_cast_fp16 = reshape(shape = var_129, x = linear_1_cast_fp16)[name = tensor<string, []>("op_130_cast_fp16")];
            tensor<int32, [4]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_136_cast_fp16 = reshape(shape = var_135, x = linear_2_cast_fp16)[name = tensor<string, []>("op_136_cast_fp16")];
            tensor<int32, [4]> var_137 = const()[name = tensor<string, []>("op_137"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1500, 12, 64]> mul_0_cast_fp16 = mul(x = var_124_cast_fp16, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 1500, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = var_130_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 12, 1500, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 12, 1500, 1500]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 1500, 1500]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> a_1_transpose_x_0 = const()[name = tensor<string, []>("a_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> a_1_transpose_y_0 = const()[name = tensor<string, []>("a_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> v_3_cast_fp16 = transpose(perm = var_137, x = var_136_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 12, 1500, 64]> a_1_cast_fp16 = matmul(transpose_x = a_1_transpose_x_0, transpose_y = a_1_transpose_y_0, x = softmax_0_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("a_1_cast_fp16")];
            tensor<int32, [4]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> var_141_cast_fp16 = transpose(perm = var_140, x = a_1_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 1500, 768]> x_11_cast_fp16 = reshape(shape = concat_0, x = var_141_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [768, 768]> const_15_to_fp16 = const()[name = tensor<string, []>("const_15_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9762176)))];
            tensor<fp16, [768]> const_16_to_fp16 = const()[name = tensor<string, []>("const_16_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10941888)))];
            tensor<fp16, [1, 1500, 768]> linear_3_cast_fp16 = linear(bias = const_16_to_fp16, weight = const_15_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_13_cast_fp16 = add(x = var_71_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [1]> var_153_axes_0 = const()[name = tensor<string, []>("op_153_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_0_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10943488)))];
            tensor<fp16, [768]> blocks_0_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10945088)))];
            tensor<fp16, [1, 1500, 768]> var_153_cast_fp16 = layer_norm(axes = var_153_axes_0, beta = blocks_0_mlp_ln_bias_to_fp16, epsilon = var_89_to_fp16, gamma = blocks_0_mlp_ln_weight_to_fp16, x = x_13_cast_fp16)[name = tensor<string, []>("op_153_cast_fp16")];
            tensor<fp16, [3072, 768]> const_17_to_fp16 = const()[name = tensor<string, []>("const_17_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10946688)))];
            tensor<fp16, [3072]> const_18_to_fp16 = const()[name = tensor<string, []>("const_18_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15665344)))];
            tensor<fp16, [1, 1500, 3072]> linear_4_cast_fp16 = linear(bias = const_18_to_fp16, weight = const_17_to_fp16, x = var_153_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> x_17_mode_0 = const()[name = tensor<string, []>("x_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_17_cast_fp16 = gelu(mode = x_17_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<fp16, [768, 3072]> const_19_to_fp16 = const()[name = tensor<string, []>("const_19_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15671552)))];
            tensor<fp16, [768]> const_20_to_fp16 = const()[name = tensor<string, []>("const_20_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390208)))];
            tensor<fp16, [1, 1500, 768]> linear_5_cast_fp16 = linear(bias = const_20_to_fp16, weight = const_19_to_fp16, x = x_17_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_19_cast_fp16 = add(x = x_13_cast_fp16, y = linear_5_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [1]> var_194_axes_0 = const()[name = tensor<string, []>("op_194_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_1_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20391808)))];
            tensor<fp16, [768]> blocks_1_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20393408)))];
            tensor<fp16, []> var_184_to_fp16 = const()[name = tensor<string, []>("op_184_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_194_cast_fp16 = layer_norm(axes = var_194_axes_0, beta = blocks_1_attn_ln_bias_to_fp16, epsilon = var_184_to_fp16, gamma = blocks_1_attn_ln_weight_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("op_194_cast_fp16")];
            tensor<fp16, [768, 768]> const_21_to_fp16 = const()[name = tensor<string, []>("const_21_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20395008)))];
            tensor<fp16, [768]> const_22_to_fp16 = const()[name = tensor<string, []>("const_22_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21574720)))];
            tensor<fp16, [1, 1500, 768]> linear_6_cast_fp16 = linear(bias = const_22_to_fp16, weight = const_21_to_fp16, x = var_194_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<fp16, [768, 768]> const_23_to_fp16 = const()[name = tensor<string, []>("const_23_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21576320)))];
            tensor<fp16, [1, 1500, 768]> linear_7_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = const_23_to_fp16, x = var_194_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [768, 768]> const_24_to_fp16 = const()[name = tensor<string, []>("const_24_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22756032)))];
            tensor<fp16, [768]> const_25_to_fp16 = const()[name = tensor<string, []>("const_25_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23935744)))];
            tensor<fp16, [1, 1500, 768]> linear_8_cast_fp16 = linear(bias = const_25_to_fp16, weight = const_24_to_fp16, x = var_194_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_219_cast_fp16 = reshape(shape = var_218, x = linear_6_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<int32, [4]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_225_cast_fp16 = reshape(shape = var_224, x = linear_7_cast_fp16)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<int32, [4]> var_230 = const()[name = tensor<string, []>("op_230"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_231_cast_fp16 = reshape(shape = var_230, x = linear_8_cast_fp16)[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<int32, [4]> var_232 = const()[name = tensor<string, []>("op_232"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1500, 12, 64]> mul_1_cast_fp16 = mul(x = var_219_cast_fp16, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 1500, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = var_225_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 12, 1500, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 12, 1500, 1500]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 1500, 1500]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> a_3_transpose_x_0 = const()[name = tensor<string, []>("a_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> a_3_transpose_y_0 = const()[name = tensor<string, []>("a_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> v_7_cast_fp16 = transpose(perm = var_232, x = var_231_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 12, 1500, 64]> a_3_cast_fp16 = matmul(transpose_x = a_3_transpose_x_0, transpose_y = a_3_transpose_y_0, x = softmax_1_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("a_3_cast_fp16")];
            tensor<int32, [4]> var_235 = const()[name = tensor<string, []>("op_235"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_1 = const()[name = tensor<string, []>("concat_1"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> var_236_cast_fp16 = transpose(perm = var_235, x = a_3_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, 1500, 768]> x_23_cast_fp16 = reshape(shape = concat_1, x = var_236_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<fp16, [768, 768]> const_32_to_fp16 = const()[name = tensor<string, []>("const_32_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23937344)))];
            tensor<fp16, [768]> const_33_to_fp16 = const()[name = tensor<string, []>("const_33_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25117056)))];
            tensor<fp16, [1, 1500, 768]> linear_9_cast_fp16 = linear(bias = const_33_to_fp16, weight = const_32_to_fp16, x = x_23_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_25_cast_fp16 = add(x = x_19_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("x_25_cast_fp16")];
            tensor<int32, [1]> var_248_axes_0 = const()[name = tensor<string, []>("op_248_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_1_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25118656)))];
            tensor<fp16, [768]> blocks_1_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25120256)))];
            tensor<fp16, [1, 1500, 768]> var_248_cast_fp16 = layer_norm(axes = var_248_axes_0, beta = blocks_1_mlp_ln_bias_to_fp16, epsilon = var_184_to_fp16, gamma = blocks_1_mlp_ln_weight_to_fp16, x = x_25_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<fp16, [3072, 768]> const_34_to_fp16 = const()[name = tensor<string, []>("const_34_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25121856)))];
            tensor<fp16, [3072]> const_35_to_fp16 = const()[name = tensor<string, []>("const_35_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29840512)))];
            tensor<fp16, [1, 1500, 3072]> linear_10_cast_fp16 = linear(bias = const_35_to_fp16, weight = const_34_to_fp16, x = var_248_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> x_29_mode_0 = const()[name = tensor<string, []>("x_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_29_cast_fp16 = gelu(mode = x_29_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<fp16, [768, 3072]> const_36_to_fp16 = const()[name = tensor<string, []>("const_36_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29846720)))];
            tensor<fp16, [768]> const_37_to_fp16 = const()[name = tensor<string, []>("const_37_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34565376)))];
            tensor<fp16, [1, 1500, 768]> linear_11_cast_fp16 = linear(bias = const_37_to_fp16, weight = const_36_to_fp16, x = x_29_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_31_cast_fp16 = add(x = x_25_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("x_31_cast_fp16")];
            tensor<int32, [1]> var_289_axes_0 = const()[name = tensor<string, []>("op_289_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_2_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34566976)))];
            tensor<fp16, [768]> blocks_2_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34568576)))];
            tensor<fp16, []> var_279_to_fp16 = const()[name = tensor<string, []>("op_279_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_289_cast_fp16 = layer_norm(axes = var_289_axes_0, beta = blocks_2_attn_ln_bias_to_fp16, epsilon = var_279_to_fp16, gamma = blocks_2_attn_ln_weight_to_fp16, x = x_31_cast_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<fp16, [768, 768]> const_38_to_fp16 = const()[name = tensor<string, []>("const_38_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34570176)))];
            tensor<fp16, [768]> const_39_to_fp16 = const()[name = tensor<string, []>("const_39_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35749888)))];
            tensor<fp16, [1, 1500, 768]> linear_12_cast_fp16 = linear(bias = const_39_to_fp16, weight = const_38_to_fp16, x = var_289_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [768, 768]> const_40_to_fp16 = const()[name = tensor<string, []>("const_40_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35751488)))];
            tensor<fp16, [1, 1500, 768]> linear_13_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = const_40_to_fp16, x = var_289_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [768, 768]> const_41_to_fp16 = const()[name = tensor<string, []>("const_41_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36931200)))];
            tensor<fp16, [768]> const_42_to_fp16 = const()[name = tensor<string, []>("const_42_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38110912)))];
            tensor<fp16, [1, 1500, 768]> linear_14_cast_fp16 = linear(bias = const_42_to_fp16, weight = const_41_to_fp16, x = var_289_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_314_cast_fp16 = reshape(shape = var_313, x = linear_12_cast_fp16)[name = tensor<string, []>("op_314_cast_fp16")];
            tensor<int32, [4]> var_319 = const()[name = tensor<string, []>("op_319"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_320_cast_fp16 = reshape(shape = var_319, x = linear_13_cast_fp16)[name = tensor<string, []>("op_320_cast_fp16")];
            tensor<int32, [4]> var_325 = const()[name = tensor<string, []>("op_325"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_326_cast_fp16 = reshape(shape = var_325, x = linear_14_cast_fp16)[name = tensor<string, []>("op_326_cast_fp16")];
            tensor<int32, [4]> var_327 = const()[name = tensor<string, []>("op_327"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_2_y_0_to_fp16 = const()[name = tensor<string, []>("mul_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1500, 12, 64]> mul_2_cast_fp16 = mul(x = var_314_cast_fp16, y = mul_2_y_0_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 1500, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = var_320_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 12, 1500, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 12, 1500, 1500]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 1500, 1500]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> a_5_transpose_x_0 = const()[name = tensor<string, []>("a_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> a_5_transpose_y_0 = const()[name = tensor<string, []>("a_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> v_11_cast_fp16 = transpose(perm = var_327, x = var_326_cast_fp16)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 12, 1500, 64]> a_5_cast_fp16 = matmul(transpose_x = a_5_transpose_x_0, transpose_y = a_5_transpose_y_0, x = softmax_2_cast_fp16, y = v_11_cast_fp16)[name = tensor<string, []>("a_5_cast_fp16")];
            tensor<int32, [4]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_2 = const()[name = tensor<string, []>("concat_2"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> var_331_cast_fp16 = transpose(perm = var_330, x = a_5_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, 1500, 768]> x_35_cast_fp16 = reshape(shape = concat_2, x = var_331_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<fp16, [768, 768]> const_49_to_fp16 = const()[name = tensor<string, []>("const_49_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38112512)))];
            tensor<fp16, [768]> const_50_to_fp16 = const()[name = tensor<string, []>("const_50_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39292224)))];
            tensor<fp16, [1, 1500, 768]> linear_15_cast_fp16 = linear(bias = const_50_to_fp16, weight = const_49_to_fp16, x = x_35_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_37_cast_fp16 = add(x = x_31_cast_fp16, y = linear_15_cast_fp16)[name = tensor<string, []>("x_37_cast_fp16")];
            tensor<int32, [1]> var_343_axes_0 = const()[name = tensor<string, []>("op_343_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_2_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39293824)))];
            tensor<fp16, [768]> blocks_2_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39295424)))];
            tensor<fp16, [1, 1500, 768]> var_343_cast_fp16 = layer_norm(axes = var_343_axes_0, beta = blocks_2_mlp_ln_bias_to_fp16, epsilon = var_279_to_fp16, gamma = blocks_2_mlp_ln_weight_to_fp16, x = x_37_cast_fp16)[name = tensor<string, []>("op_343_cast_fp16")];
            tensor<fp16, [3072, 768]> const_51_to_fp16 = const()[name = tensor<string, []>("const_51_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39297024)))];
            tensor<fp16, [3072]> const_52_to_fp16 = const()[name = tensor<string, []>("const_52_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44015680)))];
            tensor<fp16, [1, 1500, 3072]> linear_16_cast_fp16 = linear(bias = const_52_to_fp16, weight = const_51_to_fp16, x = var_343_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> x_41_mode_0 = const()[name = tensor<string, []>("x_41_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_41_cast_fp16 = gelu(mode = x_41_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("x_41_cast_fp16")];
            tensor<fp16, [768, 3072]> const_53_to_fp16 = const()[name = tensor<string, []>("const_53_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44021888)))];
            tensor<fp16, [768]> const_54_to_fp16 = const()[name = tensor<string, []>("const_54_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48740544)))];
            tensor<fp16, [1, 1500, 768]> linear_17_cast_fp16 = linear(bias = const_54_to_fp16, weight = const_53_to_fp16, x = x_41_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_43_cast_fp16 = add(x = x_37_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("x_43_cast_fp16")];
            tensor<int32, [1]> var_384_axes_0 = const()[name = tensor<string, []>("op_384_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_3_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48742144)))];
            tensor<fp16, [768]> blocks_3_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48743744)))];
            tensor<fp16, []> var_374_to_fp16 = const()[name = tensor<string, []>("op_374_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_384_cast_fp16 = layer_norm(axes = var_384_axes_0, beta = blocks_3_attn_ln_bias_to_fp16, epsilon = var_374_to_fp16, gamma = blocks_3_attn_ln_weight_to_fp16, x = x_43_cast_fp16)[name = tensor<string, []>("op_384_cast_fp16")];
            tensor<fp16, [768, 768]> const_55_to_fp16 = const()[name = tensor<string, []>("const_55_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48745344)))];
            tensor<fp16, [768]> const_56_to_fp16 = const()[name = tensor<string, []>("const_56_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49925056)))];
            tensor<fp16, [1, 1500, 768]> linear_18_cast_fp16 = linear(bias = const_56_to_fp16, weight = const_55_to_fp16, x = var_384_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<fp16, [768, 768]> const_57_to_fp16 = const()[name = tensor<string, []>("const_57_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49926656)))];
            tensor<fp16, [1, 1500, 768]> linear_19_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = const_57_to_fp16, x = var_384_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<fp16, [768, 768]> const_58_to_fp16 = const()[name = tensor<string, []>("const_58_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51106368)))];
            tensor<fp16, [768]> const_59_to_fp16 = const()[name = tensor<string, []>("const_59_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52286080)))];
            tensor<fp16, [1, 1500, 768]> linear_20_cast_fp16 = linear(bias = const_59_to_fp16, weight = const_58_to_fp16, x = var_384_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> var_408 = const()[name = tensor<string, []>("op_408"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_409_cast_fp16 = reshape(shape = var_408, x = linear_18_cast_fp16)[name = tensor<string, []>("op_409_cast_fp16")];
            tensor<int32, [4]> var_414 = const()[name = tensor<string, []>("op_414"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_415_cast_fp16 = reshape(shape = var_414, x = linear_19_cast_fp16)[name = tensor<string, []>("op_415_cast_fp16")];
            tensor<int32, [4]> var_420 = const()[name = tensor<string, []>("op_420"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_421_cast_fp16 = reshape(shape = var_420, x = linear_20_cast_fp16)[name = tensor<string, []>("op_421_cast_fp16")];
            tensor<int32, [4]> var_422 = const()[name = tensor<string, []>("op_422"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_3_y_0_to_fp16 = const()[name = tensor<string, []>("mul_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 1500, 12, 64]> mul_3_cast_fp16 = mul(x = var_409_cast_fp16, y = mul_3_y_0_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = tensor<string, []>("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = tensor<string, []>("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 1500, 64]> transpose_55 = transpose(perm = transpose_55_perm_0, x = var_415_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 12, 1500, 64]> transpose_54 = transpose(perm = transpose_54_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 12, 1500, 1500]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_54, y = transpose_55)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 1500, 1500]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
            tensor<bool, []> a_7_transpose_x_0 = const()[name = tensor<string, []>("a_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> a_7_transpose_y_0 = const()[name = tensor<string, []>("a_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> v_15_cast_fp16 = transpose(perm = var_422, x = var_421_cast_fp16)[name = tensor<string, []>("transpose_107")];
            tensor<fp16, [1, 12, 1500, 64]> a_7_cast_fp16 = matmul(transpose_x = a_7_transpose_x_0, transpose_y = a_7_transpose_y_0, x = softmax_3_cast_fp16, y = v_15_cast_fp16)[name = tensor<string, []>("a_7_cast_fp16")];
            tensor<int32, [4]> var_425 = const()[name = tensor<string, []>("op_425"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_3 = const()[name = tensor<string, []>("concat_3"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> var_426_cast_fp16 = transpose(perm = var_425, x = a_7_cast_fp16)[name = tensor<string, []>("transpose_104")];
            tensor<fp16, [1, 1500, 768]> x_47_cast_fp16 = reshape(shape = concat_3, x = var_426_cast_fp16)[name = tensor<string, []>("x_47_cast_fp16")];
            tensor<fp16, [768, 768]> const_66_to_fp16 = const()[name = tensor<string, []>("const_66_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52287680)))];
            tensor<fp16, [768]> const_67_to_fp16 = const()[name = tensor<string, []>("const_67_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53467392)))];
            tensor<fp16, [1, 1500, 768]> linear_21_cast_fp16 = linear(bias = const_67_to_fp16, weight = const_66_to_fp16, x = x_47_cast_fp16)[name = tensor<string, []>("linear_21_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_49_cast_fp16 = add(x = x_43_cast_fp16, y = linear_21_cast_fp16)[name = tensor<string, []>("x_49_cast_fp16")];
            tensor<int32, [1]> var_438_axes_0 = const()[name = tensor<string, []>("op_438_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_3_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53468992)))];
            tensor<fp16, [768]> blocks_3_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53470592)))];
            tensor<fp16, [1, 1500, 768]> var_438_cast_fp16 = layer_norm(axes = var_438_axes_0, beta = blocks_3_mlp_ln_bias_to_fp16, epsilon = var_374_to_fp16, gamma = blocks_3_mlp_ln_weight_to_fp16, x = x_49_cast_fp16)[name = tensor<string, []>("op_438_cast_fp16")];
            tensor<fp16, [3072, 768]> const_68_to_fp16 = const()[name = tensor<string, []>("const_68_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53472192)))];
            tensor<fp16, [3072]> const_69_to_fp16 = const()[name = tensor<string, []>("const_69_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58190848)))];
            tensor<fp16, [1, 1500, 3072]> linear_22_cast_fp16 = linear(bias = const_69_to_fp16, weight = const_68_to_fp16, x = var_438_cast_fp16)[name = tensor<string, []>("linear_22_cast_fp16")];
            tensor<string, []> x_53_mode_0 = const()[name = tensor<string, []>("x_53_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_53_cast_fp16 = gelu(mode = x_53_mode_0, x = linear_22_cast_fp16)[name = tensor<string, []>("x_53_cast_fp16")];
            tensor<fp16, [768, 3072]> const_70_to_fp16 = const()[name = tensor<string, []>("const_70_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58197056)))];
            tensor<fp16, [768]> const_71_to_fp16 = const()[name = tensor<string, []>("const_71_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62915712)))];
            tensor<fp16, [1, 1500, 768]> linear_23_cast_fp16 = linear(bias = const_71_to_fp16, weight = const_70_to_fp16, x = x_53_cast_fp16)[name = tensor<string, []>("linear_23_cast_fp16")];
            tensor<fp16, [1, 1500, 768]> x_55_cast_fp16 = add(x = x_49_cast_fp16, y = linear_23_cast_fp16)[name = tensor<string, []>("x_55_cast_fp16")];
            tensor<int32, [1]> var_479_axes_0 = const()[name = tensor<string, []>("op_479_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_4_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62917312)))];
            tensor<fp16, [768]> blocks_4_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62918912)))];
            tensor<fp16, []> var_469_to_fp16 = const()[name = tensor<string, []>("op_469_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_479_cast_fp16 = layer_norm(axes = var_479_axes_0, beta = blocks_4_attn_ln_bias_to_fp16, epsilon = var_469_to_fp16, gamma = blocks_4_attn_ln_weight_to_fp16, x = x_55_cast_fp16)[name = tensor<string, []>("op_479_cast_fp16")];
            tensor<fp16, [768, 768]> const_72_to_fp16 = const()[name = tensor<string, []>("const_72_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62920512)))];
            tensor<fp16, [768]> const_73_to_fp16 = const()[name = tensor<string, []>("const_73_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64100224)))];
            tensor<fp16, [1, 1500, 768]> linear_24_cast_fp16 = linear(bias = const_73_to_fp16, weight = const_72_to_fp16, x = var_479_cast_fp16)[name = tensor<string, []>("linear_24_cast_fp16")];
            tensor<fp16, [768, 768]> const_74_to_fp16 = const()[name = tensor<string, []>("const_74_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64101824)))];
            tensor<fp16, [1, 1500, 768]> linear_25_cast_fp16 = linear(bias = linear_1_bias_0_to_fp16, weight = const_74_to_fp16, x = var_479_cast_fp16)[name = tensor<string, []>("linear_25_cast_fp16")];
            tensor<fp16, [768, 768]> const_75_to_fp16 = const()[name = tensor<string, []>("const_75_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65281536)))];
